src/Documents/итБлокировкаТоваровКПродажеНаКассе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>итБлокировкаТоваровКПродажеНаКассе</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.итСостояниеБлокировкиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировкаРазблокировка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.итСостояниеБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Форматы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/итСостояниеБлокировкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>итСостояниеБлокировкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Блокировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разблокировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ФорматыКатегорий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФорматыКатегорий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчаствуетВДвижениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеСегменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сегмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеСегменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыОборудованияГруппыТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОборудования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаТоваров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/итБлокировкаТоваровКПродажеНаКассе/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьПоУмолчаниюПриСоздании()
	
	УправлениеДиалогомСервер.ЗаполнитьДеревоПодразделений(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийУстановитьФлажки(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Истина, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСнятьФлажки(Команда)
	
	Объект.Подразделения.Очистить();
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПодразделений.ТекущиеДанные;
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийПометкаПриИзменении(ТекущиеДанные, Объект.Подразделения);
		
	//Мальцев А.Ю. +++
	массивВышестоящие = Новый Массив;
	массивПодчиненные = Новый Массив;
	ИТ_СпециальныйМодульСервер.ПолучитьВышестоящиеПодчиненныеПодразделения(ТекущиеДанные.ПодразделениеКомпании, массивВышестоящие, массивПодчиненные);
	
	Если ТекущиеДанные.Пометка Тогда
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивноСОтбором(ДеревоПодразделений.ПолучитьЭлементы(), Истина, Объект.Подразделения, массивПодчиненные);	
	Иначе
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивноСОтбором(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения, массивВышестоящие);	
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивноСОтбором(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения, массивПодчиненные);				
	КонецЕсли;
	//Мальцев А.Ю. ---
	

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ

// Обработчик возникающий при изменении значений дополнительных реквизитов
&НаСервере
Процедура ДополнительныеРеквизитыПриИзменении(ВходныеПараметры, Дополнительно) Экспорт
	
	// При закрытии общей формы "Параметры печати" заполним табличную часть дополнительные реквизиты.
	Если НЕ ВходныеПараметры=Неопределено Тогда
		Объект.ДополнительныеРеквизиты.Очистить();
		Для каждого Строка Из ВходныеПараметры Цикл
			НоваяСтрока = Объект.ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Свойство = Строка.Свойство;
			НоваяСтрока.Значение = Строка.Значение;
			Для каждого СтрокаСвойств Из ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				Если СтрокаСвойств.Свойство = Строка.Свойство Тогда
					ЭтотОбъект[СтрокаСвойств.ИмяРеквизитаЗначение]=Строка.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ДополнительныеРеквизитыПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.итБлокировкаТоваровКПродажеНаКассе.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	Если Объект.ХозОперация = Справочники.ХозОперации.Блокировка Тогда
		Объект.БлокировкаРазблокировка = Перечисления.итСостояниеБлокировкиТоваров.Блокировка;
	Иначе
		Объект.БлокировкаРазблокировка = Перечисления.итСостояниеБлокировкиТоваров.Разблокировка;
	КонецЕсли;	
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ИТ_ШаблоныИнтерваловПоЛимитамКасс.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПоУмолчаниюПриСоздании();	
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых документов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	ДеревоФорматовОбновитьНаСервере();
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Процедура БлокировкаРазблокировкаПриИзмененииНаСервере()

	Если Объект.БлокировкаРазблокировка = Перечисления.итСостояниеБлокировкиТоваров.Блокировка Тогда
		Объект.ХозОперация = Справочники.ХозОперации.Блокировка;
	Иначе
		Объект.ХозОперация = Справочники.ХозОперации.Разблокировка;
	КонецЕсли;	
	
	
	// Вызываем обработчик изменения данных объекта
	Документы.итБлокировкаТоваровКПродажеНаКассе.ХозОперацияПриИзменении(Объект);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	

КонецПроцедуры

&НаКлиенте
Процедура БлокировкаРазблокировкаПриИзменении(Элемент)
	БлокировкаРазблокировкаПриИзмененииНаСервере();
КонецПроцедуры

//Форматы

&НаКлиенте
Процедура ФорматыПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	ДеревоФоматовИзменитьПометкуФормата(ТекДанные.Формат,Ложь,Ложь);
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ФорматыФорматПриИзменении(Элемент)
//	ТекСтрока = Элементы.Форматы.ТекущаяСтрока;
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
//	Если ЗначениеЗаполнено(ТекДанные.Формат) Тогда
////		ШахматкаДобавитьФорматНаСервере(ТекДанные.Формат,,ТекДанные.НомерСтроки-1);
//	КонецЕсли;
	ФорматыДобавитьФорматНаСервере(ТекДанные.НомерСтроки-1);
	ДеревоФорматовОбновитьНаСервере();
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());

КонецПроцедуры

&НаСервере
Процедура ФорматыДобавитьФорматНаСервере(Индекс)

	//СтрокаТЧ = Объект.Форматы.НайтиПоИдентификатору(Индекс);
	//
	//Если (НЕ СтрокаТЧ = Неопределено) Тогда 
	//	Если ЗначениеЗаполнено(СтрокаТЧ.Формат) Тогда 
	//		СтрокаТЧ.ФорматКод = СтрокаТЧ.Формат.Код;
	//		СтрокаТЧ.НеУчаствуетВДвижениях = СтрокаТЧ.Формат.НеУчаствуетВДвижениях;
	//	Иначе
	//		СтрокаТЧ.ФорматКод = ""
	//	КонецЕсли;;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДеревоФоматовИзменитьПометкуФормата(Формат,НовоеЗначение,ФорматНайден)
	ЗначениеДереваФорматов = РеквизитФормыВЗначение("ДеревоФорматов");
	ДеревоФоматовИзменитьПометкуФорматаВРекурсии(ЗначениеДереваФорматов,Формат,НовоеЗначение,ФорматНайден);
	ЗначениеВРеквизитФормы(ЗначениеДереваФорматов,"ДеревоФорматов");
КонецПроцедуры

&НаСервере
Процедура ДеревоФоматовИзменитьПометкуФорматаВРекурсии(ВеткаДерева=Неопределено,Формат,НовоеЗначение,ФорматНайден)
	Если ВеткаДерева=Неопределено Тогда 
		ВеткаДерева = РеквизитФормыВЗначение("ДеревоФорматов");
	КонецЕсли;
	Для Каждого Строка Из ВеткаДерева.Строки Цикл
		Если ФорматНайден Тогда Возврат КонецЕсли;
		Если Строка.Формат = Формат Тогда 
			Строка.Пометка = НовоеЗначение;
			ФорматНайден = Истина;
		Иначе
			ДеревоФоматовИзменитьПометкуФорматаВРекурсии(Строка,Формат,НовоеЗначение,ФорматНайден);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФоматовРазвернутьВсеУровни(ЭлементФормыДерево, ВеткаДерева) 
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ЭлементФормыДерево.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовСвернутьВсеУровни(ЭлементФормыДерево, ВеткаДерева) 
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ВложенныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Если ВложенныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДеревоФорматовСвернутьВсеУровни(ЭлементФормыДерево, ВложенныеСтроки);
		ЭлементФормыДерево.Свернуть(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДеревоФоматовРазвернутьПомеченныеСтроки(ЭлементФормыДерево, ВеткаДерева) 
	
	Результат = Ложь;
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка Тогда
			Результат = Истина;
		КонецЕсли;
		ВложенныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Если ВложенныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ДеревоФоматовРазвернутьПомеченныеСтроки(ЭлементФормыДерево, ВложенныеСтроки) Тогда
			ЭлементФормыДерево.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДеревоФорматовПометкаПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоФорматов.ТекущиеДанные;
	Если ТекДанные.НеУчаствуетВДвижениях Тогда 
		ДеревоФорматовПометкаГруппыПриИзмененииНаСервере(ТекДанные.Формат,ТекДанные.Пометка);
	КонецЕсли;
	ДеревоФорматовПометкаПриИзмененииНаСервере(ТекДанные.Формат,ТекДанные.Пометка,ТекДанные.ФорматКод,ТекДанные.НеУчаствуетВДвижениях);
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовПометкаГруппыПриИзмененииНаСервере(Формат,Пометка)
	ЗначениеДереваФорматов = РеквизитФормыВЗначение("ДеревоФорматов",Тип("ДеревоЗначений"));
	СтрокаФормата = ЗначениеДереваФорматов.Строки.Найти(Формат,"Формат",Истина);
	ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(СтрокаФормата,Пометка);
	СтрокаФормата.Пометка = Пометка;
	ЗначениеВРеквизитФормы(ЗначениеДереваФорматов,"ДеревоФорматов");
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовПометкаПриИзмененииНаСервере(Формат,Пометка,ФорматКод,НеУчаствуетВДвижениях = Ложь)
	//Если НеУчаствуетВДвижениях Тогда 
	//	Возврат
	//КонецЕсли;
	СтрокиФормата = Объект.Форматы.НайтиСтроки(Новый Структура("Формат",Формат));
	Если Пометка Тогда 
		Если СтрокиФормата.Количество() = 0 Тогда
			НоваяСтрока = Объект.Форматы.Добавить();
			НоваяСтрока.Формат = Формат;
		КонецЕсли;
	Иначе
		Если СтрокиФормата.Количество() > 0 Тогда
			ФорматУдален = Ложь;
			Для Каждого СтрокаФормата Из Объект.Форматы Цикл
				Если СтрокаФормата.Формат = Формат Тогда 
					Если Не ФорматУдален Тогда
						ФорматУдален = Истина;
					КонецЕсли;
					Объект.Форматы.Удалить(СтрокаФормата.НомерСтроки - 1);
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовОбновитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектФорматы.Формат КАК Формат
	|ПОМЕСТИТЬ ОбъектФорматы
	|ИЗ
	|	&ОбъектФорматы КАК ОбъектФорматы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФорматыКатегорий.Ссылка КАК Формат,
	|	ФорматыКатегорий.Код КАК ФорматКод,
	|	ФорматыКатегорий.НеУчаствуетВДвижениях КАК НеУчаствуетВДвижениях,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектФорматы.Формат ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Пометка
	|ИЗ
	|	Справочник.ФорматыКатегорий КАК ФорматыКатегорий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектФорматы КАК ОбъектФорматы
	|		ПО ФорматыКатегорий.Ссылка = ОбъектФорматы.Формат
	|ГДЕ
	|	НЕ ФорматыКатегорий.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ФорматыКатегорий.Ссылка,
	|	ФорматыКатегорий.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФорматыКатегорий.Порядок ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ОбъектФорматы",Объект.Форматы.Выгрузить(,"Формат"));
	Дерево=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоФорматов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовУстановитьВсеФлажки(Команда)
	ДеревоФорматовИзменитьВсеФлажкиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовСнятьВсеФлажки(Команда)
	ДеревоФорматовИзменитьВсеФлажкиНаСервере(Ложь);
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовИзменитьВсеФлажкиНаСервере(Пометка)
	ЗначениеДереваФорматов = РеквизитФормыВЗначение("ДеревоФорматов");
	ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(ЗначениеДереваФорматов,Пометка);
	ЗначениеВРеквизитФормы(ЗначениеДереваФорматов,"ДеревоФорматов");
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(ВеткаДерева,Пометка)
	Для Каждого ТекущаяСтрока Из ВеткаДерева.Строки Цикл
		Если (Не ТекущаяСтрока.Пометка = Пометка) Тогда
			ТекущаяСтрока.Пометка = Пометка;
			ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(ТекущаяСтрока,Пометка);
			ДеревоФорматовПометкаПриИзмененииНаСервере(ТекущаяСтрока.Формат,Пометка,ТекущаяСтрока.ФорматКод,ТекущаяСтрока.НеУчаствуетВДвижениях);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовРазвернутьВсеСтроки(Команда)
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовСвернутьВсеСтроки(Команда)
	ДеревоФорматовСвернутьВсеУровни(Элементы.ДеревоФорматов, ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДействияПриИзменении(Элемент)
	Если Не ПроверитьПравильностьЗаполненияДаты() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания должна быть не раньше даты начала действия и даты документа",,"ДатаОкончанияДействия","Объект.ДатаОкончанияДействия");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПравильностьЗаполненияДаты(Отказ=Ложь)
	Если (Не Объект.ДатаОкончанияДействия = '00010101')
		И (Объект.ДатаОкончанияДействия < Объект.ДатаНачалаДействия
			Или Объект.ДатаОкончанияДействия < Объект.Дата) Тогда 
		Отказ = Истина;
	КонецЕсли;
	Возврат Не Отказ;
КонецФункции

&НаКлиенте
Процедура ФорматыПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматыПереместитьВниз(Команда)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	ФорматыПереместитьВнизНаСервере(ТекДанные.НомерСтроки-1);
	Элементы.Форматы.Обновить();
КонецПроцедуры

&НаСервере
Процедура ФорматыПереместитьВнизНаСервере(ТекСтрока)
	Если ТекСтрока < Объект.Форматы.Количество()-1 Тогда
		Объект.Форматы.Сдвинуть(ТекСтрока,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФорматыПереместитьВверх(Команда)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	ФорматыПереместитьВверхНаСервере(ТекДанные.НомерСтроки-1);
	Элементы.Форматы.Обновить();
КонецПроцедуры

&НаСервере
Процедура ФорматыПереместитьВверхНаСервере(ТекСтрока)
	Если ТекСтрока > 0 Тогда
		Объект.Форматы.Сдвинуть(ТекСтрока,-1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
